app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    if params["artist_id"]
      @artist = Artist.find_by(id: params["artist_id"])
      if @artist
        @songs = @artist.songs.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @song = Song.find_by(id: params["id"])
    if @song != nil
      @artist = @song.artist
      if !@artist
        if params["artist_id"]
          @artist = Artist.find_by(id: params["artist_id"])